# Pandas

In [1]:
import pandas as pd
import numpy as np

### 生成Pandas对象

Series

In [2]:
# 一维Series可用一维列表初始化
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
s.shape

(6,)

DataFrame

DateFrame是一个二维结构，这里首先构建一个时间序列，作为第一维的下标

In [5]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [71]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.267376  0.585746 -0.196869  0.768682
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938
2013-01-03  0.960549 -0.501705 -0.738993  0.691028
2013-01-04  1.114202  0.533635 -1.448454 -0.518114
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224
2013-01-06 -0.448290  0.576860  0.673624  0.234582

默认情况，如果不指定index和column，则值将用从0开始的数字替代

除了向DataFrame 传入二维数组，也可以使用字典传入数据

In [7]:
df2 = pd.DataFrame({
    "a":1,
    "b":pd.Timestamp("20130101"),
    "c":pd.Series(1,index=list(range(4)),dtype="float32")
})
df2

   a          b    c
0  1 2013-01-01  1.0
1  1 2013-01-01  1.0
2  1 2013-01-01  1.0
3  1 2013-01-01  1.0

### 查看数据

头尾数据

head 和 tail 方法可以分别查看最前面几行和最后面几行的数据（默认为5）

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282

In [9]:
df.tail()

                   A         B         C         D
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

### 下标，列标，数据

下标

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

列标

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

数据值

In [12]:
df.values

array([[-1.40290331,  0.04958243, -1.16148888, -0.29399048],
       [ 0.97875608,  0.901375  ,  0.41551677, -0.38232086],
       [ 0.79544216, -0.95828922, -1.09920733,  0.41636588],
       [ 0.5301262 ,  1.77963064, -0.15955543,  0.08813917],
       [ 0.61620956, -0.33582861, -1.17698874,  0.82928246],
       [ 0.15070979,  0.54993001,  0.63827777,  1.40447973]])

### 排序

sort_index 方法按照下标大小排序，axis=0表示按照第0维排序

In [13]:
df

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [14]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06  0.150710  0.549930  0.638278  1.404480
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.293990 -1.161489  0.049582 -1.402903
2013-01-02 -0.382321  0.415517  0.901375  0.978756
2013-01-03  0.416366 -1.099207 -0.958289  0.795442
2013-01-04  0.088139 -0.159555  1.779631  0.530126
2013-01-05  0.829282 -1.176989 -0.335829  0.616210
2013-01-06  1.404480  0.638278  0.549930  0.150710

sort_values 按照 by 值的大小进行排序

In [18]:
df.sort_values(by="A")

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-06  0.150710  0.549930  0.638278  1.404480
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-02  0.978756  0.901375  0.415517 -0.382321

In [17]:
df.sort_values(by="A", ascending=False)

                   A         B         C         D
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-06  0.150710  0.549930  0.638278  1.404480
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990

### 索引

虽然 DataFrame 支持 Python/Numpy的索引语法，但是推荐使用 .at, .iat, .loc, .iloc 和 .ix 方法进行索引

In [19]:
# 读取数据
df['A']

2013-01-01   -1.402903
2013-01-02    0.978756
2013-01-03    0.795442
2013-01-04    0.530126
2013-01-05    0.616210
2013-01-06    0.150710
Freq: D, Name: A, dtype: float64

In [20]:
df.A

2013-01-01   -1.402903
2013-01-02    0.978756
2013-01-03    0.795442
2013-01-04    0.530126
2013-01-05    0.616210
2013-01-06    0.150710
Freq: D, Name: A, dtype: float64

In [21]:
# 使用切片读取多行
df[1:3]

                   A         B         C         D
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366

In [22]:
# 按名字进行切片
df["2013-01-03":"2013-01-06"]

                   A         B         C         D
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

#### 使用 label 进行索引 - loc

In [24]:
df.loc[:,'B']

2013-01-01    0.049582
2013-01-02    0.901375
2013-01-03   -0.958289
2013-01-04    1.779631
2013-01-05   -0.335829
2013-01-06    0.549930
Freq: D, Name: B, dtype: float64

In [29]:
# 选择多行多列
df.loc["2013-01-02":"2013-01-05",["B","D"]]

                   B         D
2013-01-02  0.901375 -0.382321
2013-01-03 -0.958289  0.416366
2013-01-04  1.779631  0.088139
2013-01-05 -0.335829  0.829282

In [30]:
# 数据降维
df.loc["20130102",["A","C"]]

A    0.978756
C    0.415517
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
# 直接获取标量值
df.loc["2013-01-05","A"]

0.6162095614124133

#### 使用位置索引 - iloc

In [32]:
df

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [33]:
df.iloc[1]

A    0.978756
B    0.901375
C    0.415517
D   -0.382321
Name: 2013-01-02 00:00:00, dtype: float64

连续切片

In [35]:
df.iloc[2:5, 1:3]

                   B         C
2013-01-03 -0.958289 -1.099207
2013-01-04  1.779631 -0.159555
2013-01-05 -0.335829 -1.176989

索引不连续的部分

In [36]:
df.iloc[[1,3,5],[1,3]]

                   B         D
2013-01-02  0.901375 -0.382321
2013-01-04  1.779631  0.088139
2013-01-06  0.549930  1.404480

索引整行

In [37]:
df.iloc[2:4,:]

                   A         B         C         D
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139

索引整列

In [38]:
df.iloc[:,[1,3]]

                   B         D
2013-01-01  0.049582 -0.293990
2013-01-02  0.901375 -0.382321
2013-01-03 -0.958289  0.416366
2013-01-04  1.779631  0.088139
2013-01-05 -0.335829  0.829282
2013-01-06  0.549930  1.404480

直接获取标量值

In [39]:
df.iloc[2,2]

-1.0992073260965605

### 布尔型索引

In [40]:
df

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [42]:
# 获取 C 列大于0 的行
df[df.C > 0]

                   A         B         C         D
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [44]:
# 只留下所有大于0的数值
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.049582       NaN       NaN
2013-01-02  0.978756  0.901375  0.415517       NaN
2013-01-03  0.795442       NaN       NaN  0.416366
2013-01-04  0.530126  1.779631       NaN  0.088139
2013-01-05  0.616210       NaN       NaN  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [49]:
# 使用 isin 方法做 filter 过滤
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [50]:
df2.iloc[2,2] = 0.666666
df2

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289  0.666666  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [51]:
df

                   A         B         C         D
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990
2013-01-02  0.978756  0.901375  0.415517 -0.382321
2013-01-03  0.795442 -0.958289 -1.099207  0.416366
2013-01-04  0.530126  1.779631 -0.159555  0.088139
2013-01-05  0.616210 -0.335829 -1.176989  0.829282
2013-01-06  0.150710  0.549930  0.638278  1.404480

In [52]:
df2["e"] = ["one",'two',"three","four","five","six"]
df2

                   A         B         C         D      e
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990    one
2013-01-02  0.978756  0.901375  0.415517 -0.382321    two
2013-01-03  0.795442 -0.958289  0.666666  0.416366  three
2013-01-04  0.530126  1.779631 -0.159555  0.088139   four
2013-01-05  0.616210 -0.335829 -1.176989  0.829282   five
2013-01-06  0.150710  0.549930  0.638278  1.404480    six

In [53]:
df2[df2["e"].isin(["one","three","five"])]

                   A         B         C         D      e
2013-01-01 -1.402903  0.049582 -1.161489 -0.293990    one
2013-01-03  0.795442 -0.958289  0.666666  0.416366  three
2013-01-05  0.616210 -0.335829 -1.176989  0.829282   five

### 设定数据的值

In [72]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130101",periods=6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [73]:
df

                   A         B         C         D
2013-01-01  0.267376  0.585746 -0.196869  0.768682
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938
2013-01-03  0.960549 -0.501705 -0.738993  0.691028
2013-01-04  1.114202  0.533635 -1.448454 -0.518114
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224
2013-01-06 -0.448290  0.576860  0.673624  0.234582

In [74]:
df["F"] = s1
df

                   A         B         C         D  F
2013-01-01  0.267376  0.585746 -0.196869  0.768682  1
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938  2
2013-01-03  0.960549 -0.501705 -0.738993  0.691028  3
2013-01-04  1.114202  0.533635 -1.448454 -0.518114  4
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224  5
2013-01-06 -0.448290  0.576860  0.673624  0.234582  6

使用 at 或者 iat 修改单个值

In [75]:
df.iloc[3,-1] = 8
df

                   A         B         C         D  F
2013-01-01  0.267376  0.585746 -0.196869  0.768682  1
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938  2
2013-01-03  0.960549 -0.501705 -0.738993  0.691028  3
2013-01-04  1.114202  0.533635 -1.448454 -0.518114  8
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224  5
2013-01-06 -0.448290  0.576860  0.673624  0.234582  6

In [76]:
df.at[dates[3],"F"] = 9
df

                   A         B         C         D  F
2013-01-01  0.267376  0.585746 -0.196869  0.768682  1
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938  2
2013-01-03  0.960549 -0.501705 -0.738993  0.691028  3
2013-01-04  1.114202  0.533635 -1.448454 -0.518114  9
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224  5
2013-01-06 -0.448290  0.576860  0.673624  0.234582  6

### 计算操作

每一列的均值 (默认都是计算列)

In [78]:
df

                   A         B         C         D  F
2013-01-01  0.267376  0.585746 -0.196869  0.768682  1
2013-01-02 -0.822315  0.075991 -1.817137 -1.198938  2
2013-01-03  0.960549 -0.501705 -0.738993  0.691028  3
2013-01-04  1.114202  0.533635 -1.448454 -0.518114  9
2013-01-05  1.537865 -0.439014 -0.923585 -1.232224  5
2013-01-06 -0.448290  0.576860  0.673624  0.234582  6

In [77]:
df.mean()

A    0.434898
B    0.138586
C   -0.741903
D   -0.209164
F    4.333333
dtype: float64

In [79]:
df.mean(axis=1)

2013-01-01    0.484987
2013-01-02   -0.352480
2013-01-03    0.682176
2013-01-04    1.736254
2013-01-05    0.788608
2013-01-06    1.407355
Freq: D, dtype: float64

### 合并操作

#### 连接

In [80]:
df = pd.DataFrame(np.random.randn(10,4))

In [81]:
df

          0         1         2         3
0  2.093371 -1.183039 -1.679281  0.744866
1 -0.323036 -1.354895  0.102618 -0.939632
2  0.436840 -1.580573 -2.005263  0.405665
3  0.615940 -0.270600  0.290599  0.884160
4 -0.946919 -0.046095 -0.126125 -0.877174
5  0.072182  0.347970  0.341761  0.161080
6 -2.140098  1.969601  0.198088  1.728177
7 -1.279760 -1.023959  0.886983  0.672874
8  1.377893  0.352543 -0.162299 -0.334775
9  1.147310  1.409547 -0.474375 -0.284018